import 'dart:io';
import 'dart:math';

import 'package:migration/migration/from_0_to_1/dto/_new/tale_dto.dart';
import 'package:migration/migration/from_2_to_2/add_item/base_add_helper.dart';
import 'package:migration/migration/from_2_to_2/from_2_to_2.dart';
import 'package:migration/utils/audio_util.dart';

class AddTaleHelper extends _AddTaleHelper {
  AddTaleHelper(From2to2 migration) : super(migration);

  @override
  String get taleName => 'Чарівна хустинка';

  @override
  Set<String> get extraTags => {Tags.poem};

  @override
  TaleCrewDto? _getCrew() => TaleCrewDto(
        authors: [_nataliyaZabila],
        readers: null,
        musicians: null,
        translators: null,
        graphics: null,
      );

  @override
  ChapterAudioDto? _getAudio({
    required int chapterIndex,
  }) {
    return null;
    final data = getAudioData(audioPath(chapterIndex));
    return ChapterAudioDto(
      size: data.size,
      duration: data.duration.inMilliseconds,
    );
  }

  @override
  List<String>? _getText() => [
        "У колишні давні днини,",
        "в незапам’ятні години,",
        "що від них лише казки",
        "залишились на віки, —",
        "склалась казка чи билиця,",
        "що була собі вдовиця",
        "і росла при ній дочка,",
        "вередлива та бридка.",
        "А жила в тії вдовиці",
        "ще й сирітка білолиця",
        "і такої красоти,",
        "що подоби не знайти.",
        "Вранці піде до криниці —",
        "наче місяць заясниться,",
        "як додому поверта —",
        "ніби зірка золота,",
        "а як стане говорити —",
        "мовби ронить самоцвіти,",
        "тільки пісню заспіва —",
        "все навколо ожива…",
        "Що для квітки літнє сонце —",
        "так і мати рідній доньці:",
        "і зогріє, і зростить,",
        "і від лиха захистить.",
        " ",
        "А безрідній сиротині —",
        "що калині при долині,",
        "між чужих людей зростать —",
        "тільки лиха зазнавать.",
        " ",
        "Рідна доня Якилина,",
        "що не візьме, що не кине,",
        "то за все їй похвала,",
        "ще й подяка немала.",
        " ",
        "А сирітка безталанна,",
        "красна дівчина Оксана,",
        "що не зробить — все не те,",
        "що не скаже — все пусте.",
        "Рідній доні завжди свято,",
        "все б гуляти та співати,",
        "а сирітка й хліб пече,",
        "і пере, й пряде, і тче.",
        "Та красуня білолиця",
        "не зітхає, не смутиться",
        "і в роботі, як на те,",
        "наче квітонька цвіте.",
        " ",
        "Дні біжать, роки злітають,",
        "і дівчата підростають.",
        "А як стали на порі —",
        "вже і гості на дворі:",
        "йдуть і здалека, і зблизька,",
        "б’ють вдові поклони низько,",
        "звідусіль, з чужих країв",
        "засилають старостів.",
        "Про Оксану тільки й мова,",
        "а про другу — хоч би слово!",
        "Не бере ніхто дочку,",
        "вередливу та бридку.",
        "Всім вдовиця відмовляє,",
        "а сирітку б’є та лає.",
        " ",
        "Якилина сльози ллє,",
        "ще бридкішою стає.",
        "Все одно — нема поради!",
        "І, зчорніла від досади,",
        "крашанок вдова взяла",
        "і до знахарки пішла.",
        "— Так і так, мовляв, бабусю,",
        "ще й не тим тобі вклонюся —",
        "не відмов, поворожи,",
        "у біді допоможи.",
        "Прожени мою турботу:",
        "дай хоч зілля-привороту,",
        "хоч нашли якусь ману",
        "на Оксану навісну! —",
        "А бабуся так їй каже:",
        "— От що я тобі пораджу:",
        "може, правда, може, ні,",
        "а в далекій стороні,",
        "за горами, за морями,",
        "за широкими степами,",
        "є дрімучий темний бір,",
        "де ніколи з давніх пір",
        "людське плем’я не ступало,",
        "чорних сосон не рубало…",
        "Знайдеш ти у тім бору",
        "бабу мудру та стару.",
        "В неї є чарівна скринька,",
        "а в тій скринці є хустинка.",
        "Як оту хустинку взять,",
        "в три вузли перев’язать,",
        "то хустинка безумовно",
        "три твої бажання сповнить,",
        "хоч що хочеш забажай,",
        "тільки тричі — пам’ятай.",
        "Як хустинка буде в тебе,",
        "то й придбаєш скільки треба",
        "і багатства, і краси",
        "й доню заміж віддаси!",
        "— От хустинка! Що й казати!",
        "Тільки як її дістати?",
        "Як знайти до неї слід?",
        "Чи на захід, чи на схід",
        "треба йти до того краю?",
        "— А цього вже я не знаю,",
        "може, люди проведуть,",
        "може, зорі вкажуть путь…",
        "Йде додому зла вдовиця,",
        "наче хмара-громовиця,",
        "й думку думає одну —",
        "про хустинку чарівну.",
        "А коли дійшла до хати,",
        "то й надумала: послати",
        "по хустинку чарівну",
        "ту сирітку навісну.",
        "Якщо вернеться щасливо —",
        "то й насправді буде диво,",
        "а як зіб’ється з шляху",
        "чи зустріне смерть лиху,",
        "то нехай хоч дідько плаче!..",
        "І вдовиця нетерпляче",
        "сироті дає наказ",
        "в мандри вирушити враз.",
        "Звикла дівчина в покорі",
        "все робить без перекорів:",
        "кажуть — значить треба йти",
        "і загадане знайти.",
        " ",
        "Ой розлогий світ широкий!",
        "Ліс високий, яр глибокий,",
        "сині ріки, береги,",
        "степ зелений навкруги.",
        "І лежать по всьому світі",
        "вздовж і вшир дороги биті,",
        "і наїжджені шляхи,",
        "і неходжені стежки —",
        "і вибоїсті, і рівні.",
        "Хоч на південь, хоч на північ,",
        "і на захід, і на схід —",
        "скрізь прямує людський слід.",
        "От дорогами-шляхами,",
        "невідомими стежками",
        "йде красуня молода,",
        "і легка її хода,",
        "бо назустріч їй з привітом",
        "дерева схиляють віти,",
        "край розложистих доріг",
        "квіти хиляться до ніг.",
        "Уночі травиця стеле",
        "для мандрівниці постелю,",
        "і невтомні солов’ї",
        "заколисують її.",
        " ",
        "Зійде місяць яснорогий —",
        "вкаже дівчині дорогу,",
        "стежать зорі золоті,",
        "щоб не збилася в путі.",
        "На дорозі перехожий",
        "добрим словом допоможе,",
        "а в незайманих лісах",
        "птиці виведуть на шлях.",
        "Тож Оксана і не збилась,",
        "в довгих мандрах не стомилась,",
        "не згубила красоти",
        "й наближалась до мети.",
        "І прийшла та мить жадана,",
        "як побачила Оксана",
        "той дрімучий темний бір,",
        "де ніколи з давніх пір",
        "людське плем’я не ступало,",
        "чорних сосон не рубало.",
        "І пішла шукать в бору",
        "чародійницю стару.",
        "А навколо сосни чорні,",
        "наче привиди потворні,",
        "простягають їй навстріт",
        "пелехаті лапи віт.",
        "Чагарі сухим паліччям",
        "націляються в обличчя,",
        "рвуть одежу колючки,",
        "тчуть тенета павуки.",
        "Та Оксана не вжахнеться —",
        "там від гілки відмахнеться,",
        "там лозину відведе",
        "і вперед іде та йде.",
        "От і ніч зійшла на землю,",
        "стало в лісі зовсім темно.",
        "Вилітають з гущини",
        "величезні кажани,",
        "на ялині пугач стогне…",
        "Раптом — що це? —",
        "ніби вогник",
        "десь у лісі зазорів",
        "поміж чорних стовбурів.",
        "Йде мандрівниця до світла,",
        "бачить: хатка ледь помітна,",
        "причаїлась на горбку",
        "у густім ялиннику.",
        "Та така ж стара та древня —",
        "років зо сто їй, напевно:",
        "стріха мохом поросла,",
        "призьба цвіллю зацвіла,",
        "ще й гриби перед дверима,",
        "а в віконці вогник блима.",
        "Двері — рип! І в тую ж мить",
        "вийшла баба на поріг,",
        "зморщена, мала, щуплява,",
        "голосок такий писклявий:",
        "— Хто це тут в моїм бору",
        "стурбував мене, стару?",
        "Підійшла Оксана близько,",
        "уклонилась бабі низько",
        "й каже: — Це, бабусю, я.",
        "Мати названа моя",
        "наказала в вас уклінно",
        "попрохать якусь хустину,",
        "тим-то я й прийшла до вас",
        "в отакий неслушний час!",
        "Відказала їй бабуня:",
        "— Що ж, коли вже ти,",
        "красуня,",
        "дальню путь таку пройшла",
        "і мене в бору знайшла,",
        "я твоє бажання сповню,",
        "тільки знай — не безкоштовно:",
        "ти для мене послужи —",
        "у хазяйстві поможи,",
        "і як буде, білолиця,",
        "з тебе добра робітниця,",
        "то й тобі віддячу я:",
        "буде хусточка твоя.",
        " ",
        "Хто охочий до роботи,",
        "тому праця не турбота,",
        "а Оксана, що й казать,",
        "змалку звикла працювать.",
        "Як взялась вона до діла,",
        "так робота й закипіла:",
        "тільки щось стара звелить —",
        "все вже виконано вмить.",
        "Так минули прудкобіжно,",
        "може, дні, а може, тижні,",
        "може, сплив і довший час —",
        "невідомо це для нас.",
        "Тільки от одного ранку",
        "каже баба: — Ну, Оксанко,",
        "чи бажала я, чи ні —",
        "догодила ти мені!",
        "Ось тобі чудесна скринька,",
        "а в цій скриньці є хустинка.",
        "Як оцю хустинку взять,",
        "в три вузли перев’язать,",
        "то хустинка безумовно",
        "три твої бажання сповнить,",
        "хоч що хочеш побажай,",
        "тільки тричі — пам’ятай.",
        "Та іще пересторога:",
        "ця хустинка ні для кого",
        "не придасться в ворожбі,",
        "а лише одній тобі.",
        "А як хустку віддаси ти",
        "удовиці тій неситій —",
        "чари зразу пропадуть.",
        "Прощавай, щаслива путь! —",
        "Зникла баба — де й поділась.",
        "А Оксана опинилась",
        "в полі з скринькою в руках.",
        "Перед нею — рівний шлях,",
        "сонце сяє, вітер віє,",
        "стигле жито половіє,",
        "зеленіють дерева,",
        "в небі жайворон співа.",
        "І Оксана теж співає",
        "та на скриньку поглядає:",
        "скринька, може, й чарівна,",
        "а на взір непоказна,",
        "зовсім проста, дерев’яна,",
        "а хустинка полотняна,",
        "хоч і біла, і тонка —",
        "звичайнісінька така.",
        " ",
        "Рівна стежка край дороги",
        "так і стелеться під ноги,",
        "пахне солодко земля,",
        "гай видніється здаля.",
        "Йде мандрівниця до гаю,",
        "чує — з гаю крик лунає,",
        "стогін — гомін боротьби,",
        "аж тремтять старі дуби.",
        "Лютий, хижий птах-шуліка,",
        "гостродзьобий, превеликий,",
        "злісний клекіт видає",
        "й лебедицю білу б’є.",
        "Лебедиця вже безсила,",
        "ледве зводить білі крила,",
        "розлетілось по траві",
        "пір’я, зрошене в крові.",
        "І на того вбивцю злого,",
        "на розбійника лихого",
        "кинулась Оксана вмить.",
        "Хижий птах як засичить,",
        "він Оксану вдарив дзьобом",
        "і, схопивши в лапи здобич,",
        "чорні крила розпустив",
        "і в повітря підлетів.",
        "Лебедиця загибає,",
        "стогне, б’ється… І в одчаю",
        "пригадавсь Оксані враз",
        "баби мудрої наказ:",
        "відчинила миттю скриньку,",
        "в три вузли звила хустинку",
        "та щосили як гукне:",
        "— Згинь, потворище",
        "страшне! —",
        "Хижа птаха враз пропала.",
        "На траву лебідка впала,",
        "і здорова, і жива,",
        "й каже їй такі слова:",
        "— Красна дівчино хоробра!",
        "Видно, серце в тебе добре,",
        "що хустину чарівну",
        "у хвилину цю страшну",
        "ти не стала шкодувати,",
        "щоб мене порятувати.",
        "Значить, перше",
        "з трьох бажань",
        "ти вже висловила. Глянь! —",
        "Подивилася Оксана:",
        "а хустинка полотняна",
        "тільки сповнила наказ —",
        "вдвічі зменшилася враз!",
        "Склала дівчина у скриньку",
        "чарівну свою хустинку,",
        "відпочила під дубком",
        "і пішла своїм шляхом.",
        "Йде вона і день, і другий.",
        "Через поле та яруги",
        "стежка в’ється манівцем.",
        "І прийшла кінець кінцем",
        "в затишну ясну долину,",
        "щонайкращу для спочину.",
        "Край дороги, як на те,",
        "гарна яблунька росте.",
        "Підійшла Оксана ближче,",
        "бачить: всі галузки нижчі",
        "ще зелені, молоді,",
        "а вгорі — сухі, руді.",
        "І листочки на верхів’ї,",
        "кволі, зморщені, безживні,",
        "звисли сумно із сучків,",
        "мов лахміття жебраків.",
        "— Що це, яблунько, з тобою?",
        "Чом ти хилишся з журбою",
        "і в весняні теплі дні",
        "сохнеш, наче восени?",
        "— Ах, красуне моя мила, —",
        "деревце зашелестіло, —",
        "я тому таке сумне,",
        "що було колись рясне,",
        "зацвітало пишним цвітом",
        "і родило кожне літо",
        "силу яблук золотих",
        "для старих і для малих.",
        "І мене мандрівці знали,",
        "ще здаля мене вітали",
        "і спішили в холодок",
        "під намет моїх гілок.",
        "А тепер хробак таємний",
        "підо мною риє землю,",
        "точить корінь, соки п’є,",
        "в світі жити не дає.",
        "Отже, й сохну я, і в’яну,",
        "скоро й дихать перестану,",
        "гострий біль мене пече,",
        "серце мліє боляче! —",
        "Затремтіла деревина,",
        "застогнала, як людина,",
        "і по стовбуру униз",
        "потекли краплини сліз.",
        "Жаль пройняв Оксані душу…",
        "«Що ж я тут зробити мушу?",
        "Як дивитися на це?",
        "Загибає деревце!»",
        "Тут вона відкрила скриньку,",
        "звідти витягла хустинку,",
        "зав’язала три вузли",
        "і сказала: — Вбивче злий,",
        "пропади, хробак таємний,",
        "у норі своїй підземній!",
        "А ти, яблунько, рости",
        "і по-давньому цвіти! —",
        "Тільки мовила дівчина,",
        "як почула деревина,",
        "що пекучий біль ізник",
        "і цілющий теплий сік",
        "напоїв сухе коріння",
        "і потік по стовбурині,",
        "по галузках, по листках,",
        "по засклеплених бростках.",
        "Підвелись галузки вгору,",
        "і мереживом прозорим",
        "квіти вкрили деревце.",
        "— Ой, хвала ж тобі за це! —",
        "деревце зашелестіло. —",
        "Ти зробила добре діло.",
        "Це вже друге з трьох бажань",
        "ти промовила. Поглянь! —",
        "Подивилась: від хустини",
        "залишилась четвертина,",
        "стала вся як шкураток,",
        "як кленовий той листок!",
        "Склала дівчина у скриньку",
        "чарівну свою хустинку",
        "і весела, як була,",
        "в путь далеку знов пішла.",
        " ",
        "Скоро казку повідати,",
        "та не скоро путь верстати,",
        "а Оксана йде та йде,",
        "тиху пісеньку веде.",
        "І прийшла вона помалу",
        "у країну небувалу:",
        "що ні крок — такі дива,",
        "аж мутиться голова!",
        "Там на луках квітли квіти",
        "з різнобарвних самоцвітів,",
        "в золотім ярку текла",
        "річка з чистого срібла,",
        "там росли плоди незвичні",
        "на деревах полуничних,",
        "а з розложистих дубів",
        "мед прозорий капотів;",
        "там на вербах груші спіли,",
        "там жита, мов гай, шуміли,",
        "а в колоссі зеренце:",
        "кожне — з куряче яйце!",
        "А між луками-ланами,",
        "наче сонце між хмарками,",
        "у зеленому гаю",
        "був палац із кришталю.",
        "І такий він був блискучий,",
        "так виблискував сліпуче",
        "золотий на ньому дах —",
        "аж мінилося в очах.",
        "«Що за край такий багатий?",
        "В кого б це його спитати",
        "про такую дивину?»",
        "Бачить: люди на лану.",
        "Стигле жито убирають —",
        "топором стебло рубають,",
        "в’яжуть жито у снопки,",
        "ставлять копи, як хатки.",
        "На луці збирають діти",
        "квіти з дивних самоцвітів,",
        "квіти в кошики кладуть,",
        "до палацу їх несуть.",
        "Та чомусь пісень не чути",
        "і на всіх обличчях смуток,",
        "люди всі якісь худі,",
        "заклопотані й бліді.",
        "«Що за диво дивне в світі!",
        "Тут би жити — не тужити,",
        "чом же всі такі сумні",
        "в цій чудовій стороні?»",
        "Так подумала Оксана",
        "і наблизилась до лану,",
        "де трудилися женці",
        "з топірцями у руці,",
        "й каже їм: — Щасти вам доле",
        "не журитися ніколи",
        "в цьому світлому краю,",
        "як у справжньому раю!",
        "— Ой красуне білолиця! —",
        "каже так одна їй жниця. —",
        "Цей чудовий світлий край",
        "був би, може, й справді рай,",
        "ми жили б, розкошували,",
        "працювали б, як співали,",
        "якби наше все було:",
        "хліб, і золото, й срібло.",
        "Та сюди у давні роки",
        "володар з’явивсь",
        "жорстокий —",
        "лютий згубник-лиходій,",
        "шестикрилий хижий змій.",
        "Із потворами страшними,",
        "посіпаками своїми,",
        "всі багатства з року в рік",
        "він привласнювати звик.",
        "Ще ми платимо й данину:",
        "кожен день одну людину",
        "віддаєм на смерть тяжку —",
        "на споживу хижаку…",
        "Тож іди, та без загаю,",
        "геть з цього лихого краю,",
        "доки вік дівочий твій",
        "не згубив проклятий змій!.. —",
        "Та у відповідь дівочі",
        "спалахнули гнівом очі:",
        "— Не скорятись треба! Ні!",
        "Повставайте до борні!",
        "Розбирайте миттю зброю,",
        "на потвор ідіть війною,",
        "а із змієм жартома",
        "я розправлюся сама! —",
        "На цей поклик звідусюди",
        "до Оксани збіглись люди:",
        "і жінки, й чоловіки,",
        "і дівчата, й юнаки.",
        "Грізне військо підвелося,",
        "заблищали гострі коси,",
        "і сокири, й топірці",
        "в кожній стиснулись руці.",
        "Проти них страшні потвори",
        "не змогли чинить опору,",
        "бо в народнім серці гнів,",
        "як вогонь, полум’янів.",
        "Наче в морі грізні хвилі,",
        "йшли вперед повстанці смілі,",
        "всіх побили, як змели,",
        "й до палацу підійшли.",
        "Раптом грім пішов луною",
        "над всією стороною,",
        "звивсь, як хмара, чорний дим",
        "над палацом золотим.",
        "І з страшним гарчанням",
        "грізним,",
        "з диким брязкотом залізним",
        "із палацу виповз змій,",
        "у лусці він мідяній,",
        "із шістьма крильми",
        "страшними,",
        "лапи — з кігтями кривими,",
        "з ніздрів клубом дим летить,",
        "паща полум’ям пашить.",
        "Все від жаху скам’яніло,",
        "а Оксана гордо й сміло",
        "вийшла з гнівом на лиці",
        "і з хустинкою в руці.",
        "Та як вигукне до змія:",
        "— Згинь, проклятий лиходію,",
        "зникни з світу назавжди,",
        "щоб пропали і сліди! —",
        "Застогнав тут змій безсило,",
        "розметав залізні крила,",
        "і забивсь, і затрусивсь,",
        "і крізь землю проваливсь.",
        "Наче сонцем променястим,",
        "спалахнули очі щастям.",
        "Залунав з усіх грудей",
        "вигук звільнених людей:",
        "— Слава дівчині Оксані,",
        "що усі свої бажання",
        "не для себе зберегла,",
        "а для інших віддала!",
        " ",
        "А тим часом стала хустка,",
        "як трояндова пелюстка…",
        "Вітерець як налетів,",
        "ту пелюстку підхопив,",
        "і вона злетіла вгору",
        "до блакитного простору",
        "й зникла десь в височині,",
        "мов розтала в тумані.",
        "А Оксана так сказала:",
        "— Я нічого й не бажала!",
        "Всі ці сили чарівні",
        "не згодилися б мені.",
        "Світ широкий та розлогий,",
        "скрізь ведуть шляхи-дороги,",
        "добрі люди всюди є,",
        "і ясне життя моє!",
        " ",
        "Вийшов тут з-серед народу,",
        "наче день ясний на вроду,",
        "ставний красень-молодик",
        "і сказав: — Живи повік",
        "з нами, дівчино привітна!",
        "А коли тобі самітно",
        "здасться в нашій стороні,",
        "будь дружиною мені! —",
        "Тут Оксана подивилась —",
        "наче зірка заяснилась.",
        "Посміхнулася йому —",
        "наче день осяяв тьму.",
        "Що вона йому сказала —",
        "повіли б ми, якби знали,",
        "тільки відзвук тихих слів",
        "заглушив веселий спів.",
        "Це співали люди й птахи,",
        "і метелики, й комахи,",
        "і на людські голоси",
        "відгукалися ліси.",
        "А пташинки непомітні —",
        "бистрі вісники всесвітні —",
        "про Оксану рознесли",
        "поголоску по землі.",
        "Долетіли бистрі птиці",
        "і до злісної вдовиці,",
        "що бажала всім завжди",
        "тільки горя та біди.",
        "Удова з дочкою разом",
        "аж посохли від образи,",
        "що не їм, а сироті",
        "щастя випало в житті.",
        "І така їх заздрість жерла,",
        "що вони від люті вмерли.",
        "Тож недобре бути злим",
        "і дорослим, і малим!",
      ];
}

abstract class _AddTaleHelper extends BaseAddHelper {
  _AddTaleHelper(From2to2 migration)
      : super(
          migration,
          addItemName: 'Tale',
          folderName: 'tales',
        );

  final spaceRegExp = RegExp('\\s+');
  late TaleDto tale;

  String getTalePath(int chapterIndex) => '$dataPath/$nextId/$chapterIndex/';

  String audioPath(int chapterIndex) => getTalePath(chapterIndex) + 'audio.mp3';

  @override
  Future<bool> validate({bool post = false}) async {
    try {
      final all = await getAll();

      final idList = all.map((e) => e.id).toSet();

      assert(
        idList.length == all.length,
        'Looks like we have duplicate',
      );

      if (!post) {
        nextId = (await _getLastId()) + 1;
      }

      final chapterIndex = 0;
      final path = getTalePath(chapterIndex);
      final dir = Directory(path + 'img');
      if (!dir.existsSync()) {
        dir.createSync(recursive: true);
        migration.log('Empty folder for tale was created');
        throw Exception('Please add some content to the tale folder');
      }

      if (post) {
        final imageFile = File(path + 'img/0.jpg');
        assert(
          imageFile.existsSync(),
          'Image for the tale was not found',
        );

        if (tale.tags.contains(Tags.audio)) {
          final audioFile = File(path + 'audio.mp3');
          assert(
            audioFile.existsSync(),
            'Image for the tale was not found',
          );
        }
      }
      return true;
    } catch (e) {
      migration.log(e.toString());
      return false;
    }
  }

  Future<List<TaleDto>> getAll() async {
    final json = await migration.readJsonList(jsonPath);
    final people = json.map((e) => TaleDto.fromJson(e)).toList();
    if (originalList.isEmpty) {
      originalList.addAll(people);
    }
    return people;
  }

  Future<int> _getLastId() async {
    final people = (await getAll()).map((e) => e.id);
    return people.reduce(max);
  }

  @override
  Future<void> add() async {
    final createDateDelta = const Duration(days: 1).inMilliseconds;

    final crew = _getCrew();

    final content = _getContent();
    final tags = <String>{
      if (content.first.text != null) Tags.text,
      if (content.first.audio != null) Tags.audio,
      if (crew?.authors?.isNotEmpty == true) Tags.author,
    }..addAll(extraTags);

    tale = TaleDto(
      id: nextId,
      name: taleName,
      createDate: DateTime.now().millisecondsSinceEpoch + createDateDelta,
      tags: tags,
      content: content,
      crew: crew,
      ignore: true,
    );

    final all = await getAll();
    all.add(tale);
    await saveJson(all);
  }

  String get taleName;

  TaleCrewDto? _getCrew();

  /// Other than [Tags.author],[Tags.text],[Tags.audio]
  Set<String> get extraTags;

  List<TaleChapterDto> _getContent() => [
        _createChapter0(),
      ];

  TaleChapterDto _createChapter0() => TaleChapterDto(
        title: null,
        imageCount: 1,
        text: _getText()?.map((e) => e.replaceAll(spaceRegExp, ' ')).toList(),
        audio: _getAudio(chapterIndex: 0),
      );

  ChapterAudioDto? _getAudio({
    required int chapterIndex,
  });

  List<String>? _getText();
}

class Tags {
  Tags._();

  //region added automatically
  static const String text = 'text';
  static const String author = 'author';
  static const String audio = 'audio';

  //endregion added automatically

  static const String poem = 'poem';
  static const String lullaby = 'lullaby';
}

const int _olgaTokar = 87;
const int _oskarSandler = 86;
const int _mykolaSom = 85;
const int _tinaKarol = 84;
const int _irynaGarmash = 83;
//
// const int "Тіна Кароль" = 84;
//
// const int "Ірина Гармаш" = 83;
//
// const int "Руслан Грех" = 82;
//
// const int "Леся Горова" = 81;
//
// const int "Діна Кравцова" = 80;
//
// const int "Анна Чернявська" = 79;
//
// const int "Ніка Балаж" = 78;
//
// const int "Шарль Перро" = 77;
//
// const int "Уля " = 76;
//
// const int "Алла Мігай" = 75;
//
// const int "Емілія Саталкіна" = 74;
//
// const int "Кость Дяченко" = 73;
//
// const int "Сашко Лірник" = 72;
//
// const int "Михайло Слабошпицький" = 71;
//
// const int "Анатолій Давидов" = 70;
//
// const int "Василь Вакуленко" = 69;
//
// const int "Євгенія Бурчак" = 68;
//
// const int "Вікторія Кузьміна" = 67;
//
// const int "Тарас Сліпець" = 66;
//
// const int "Оксана Смільська" = 65;
//
// const int "Владислава Сойма = 64;
//
// const int "Анатолій Михайленко" = 63;
//
// const int "Віра Карасьова = 62;
//
// const int "Микола Стеценко" = 61;
//
// const int "Олег Буцень" = 60;
//
// const int "Мирослав Вересюк" = 59;
//
// const int "Євген Башенко = 58;
//
// const int "Костянтин Ротов" = 57;
//
// const int "Максим Незгода = 56;
//
// const int "Олександр Єрох" = 55;
//
// const int "Олена Чичик = 54;
//
// const int "Леся Борсук = 53;
//
// const int "Анастасія Ножка" = 52;
//
// const int "Юлія Антонова" = 51;
//
// const int "Андрій Антонов" = 50;
//
// const int "Джоель Гарріс" = 49;
//
// const int "Денис Проуторов" = 48;
//
// const int "Світлана Харчук" = 47;
//
// const int "Анастасія Білянська" = 46;
//
// const int "Таріна Карасівна" = 45;
//
// const int "Дмитро Соколов" = 44;
//
// const int "Керстін Шьоне" = 43;
//
// const int "Світлана Колесник = 42;
//
// const int "Забіне Больман" = 41;
//
// const int "Костянтин Ушинський" = 40;
//
// const int "Ніна Матвієнко" = 39;
//
const int _ivanFranko = 38;
const int _stepanRudanskyj = 37;
const int _leonidGlibov = 36;
const int _bratyGrim = 35;
const int _marijkaPidgiryanka = 34;
const int _myhailoStelmah = 33;
const int _valentynaYurchenko = 32;
const int _serhijTatienko = 31;
const int _mykolaSygnaivskyj = 30;
const int _irynaKyrylina = 29;
const int _dmytroPavlychko = 28;
const int _andrijMalyshko = 27;
const int _platonMajboroda = 26;
const int _nataliyaZabila = 25;
const int _annaSereda = 24;
const int _grygorijBojko = 23;
const int _marijaHorosnytska = 22;
const int _anatolijKosteckyj = 21;
const int _samuilMarshak = 20;
const int _ivanMalkovych = 19;
const int _pavloGlaovyj = 18;
const int _valentynaBajkova = 17;
const int _anatolijGrygoruk = 16;
const int _yulianTuvim = 15;
const int _vasylChuhlib = 14;
const int _yanikaTereshenko = 13;
const int _viktorPavlik = 12;
const int _jannaHoma = 11;
const int _liliyaGudz = 10;
const int _tetanaLeonteva = 9;
const int _yuliaZadorojna = 8;
const int _katerynaGavrylova = 7;
const int _mariyaSoltysSmyrnove = 6;
const int _galynaMyroslava = 5;
const int _innaYavorska = 4;
const int _vasylSuhomlynskyi = 3;
const int _oksanaKrotyuk = 2;
const int _gansAndersen = 1;
const int _lesyaUkrainka = 0;
