import 'dart:convert';

import 'package:migration/migration/from_0_to_1/dto/_new/tale_dto.dart';
import 'package:migration/add_new_tale/audio_util.dart';

void main() {
  final createDateDelta = const Duration(days: 3).inMilliseconds;
  final tale = TaleDto(
    id: 207,
    name: 'Пушка і ракета',
    createDate: DateTime.now().millisecondsSinceEpoch + createDateDelta,
    tags: {
      Tags.text,
      Tags.audio,
      Tags.author,
    },
    content: _getContent(),
    crew: _getCrew(),
  );
  final jsonMap = tale.toJson();
  final string = json.encode(jsonMap);
  print(string);
}

TaleCrewDto? _getCrew() => TaleCrewDto(
      authors: [45],
      readers: [45, 66, 76],
      musicians: null,
      translators: null,
      graphics: null,
    );

List<TaleChapterDto> _getContent() {
  final chapter = TaleChapterDto(
    title: null,
    imageCount: 1,
    text: _getText(),
    audio: _getAudio(),
  );
  return [chapter];
}

ChapterAudioDto? _getAudio() {
  final path = '../data/2/tales/207/0/audio.mp3';
  final data = getAudioData(path);
  return ChapterAudioDto(
    size: data.size,
    duration: data.duration.inMilliseconds,
  );
}

List<String> _getText() => [
      "У дівчинки Улі жили кицька Пушка і такса Ракета. Дуже добре жили, скажемо ми вам.",
      "Уля їх доглядала, годувала, чухала пузце. Тваринки не бідували і щасливо гладшали (особливо коли приїжджали разом з дівчинкою до бабусі).",
      "Одного разу Ракета прокинувся від того, що хтось його теребив лапою за ніс.",
      "— Ракето, Ракето, прокидайся. Там таке! Ну таке!",
      "Такса відкрив праве око.",
      "— Вас? (Тобто Що? Наш Ракета був баварською таксою і іноді вставляв німецькі слова).",
      "— Ну Ракето! Спляча ти сосисочка! Все на світі проспиш. Дивись що нам привезли!",
      "— Фо пфифефли? — Ракета був ще й послідовною таксою. Коли він не спав, він їв.",
      "— В тому-то й справа, що я не знаю. Хто з нас двох уміє читати?",
      "Це була правда. Колись Ракета згриз Улін портфелик, а з ним і пів Букваря. Відтоді цуцик міг читати по складах.",
      "— Ніхт панікен. Фараф пофифаємо.",
      "Ракета вилизав миску і потюпцяв за Пушкою.",
      "— Ось! — Пушка ткнула лапкою у велику коробку.",
      "— Е-лек-триш-не пі-а-ні-но. — Вас іст дас, Пушко? Це їдять?",
      "— Не знаю, Ракето. Доведеться чекати на Улю.",
      "І тваринки рішуче захропли під коробкою. Прокинулись від шурхоту — це Уля саме діставала піаніно.",
      "Пушка не зводила з піаніно очей. Такі лампочки, такі чарівні звуки. Кішка закохалась у музику.",
      "Ракета саме бачив десятий сон, де Уля дарувала йому новеньку пару кросівок. Ну щоб погризти. Але передумала дарувати і почала тими кросівками Ракету постукувати.",
      "Ракета прокинувся. Постукування не припинилось. То його сонного штовхала Пушка.",
      "— Ракето, я повинна це зробити.",
      "— Пофинна вас?",
      "— Зіграти на піаніні. Я бачила, як це робить Уля. Треба тільки на клавіші натискати. Підсади!",
      "Такса чемно став під піаніно, Пушка застрибнула йому на спинку, а звідти на клавіші. Пробіглася. Звук зовсім не був схожий на музику, яку грала Уля.",
      "Пушка задумалась.",
      "— Може, я неправильно натискаю, Ракето?",
      "— Спробуй дупцею.",
      "Звук посилився, але до музики теж було далеко. Засмучена Пушка вмостилась на краєчку піаніно. Вона так хотіла сама грати музику.",
      "— Бзззззззззз!",
      "На клавіші перед Пушкою сіла величезна зелена муха. Де й взялася. Ще й на новенький інструмент. Зараз я тобі! Пушка замахнулась лапою.",
      "Муха переповзла на іншу клавішу. Лапа.",
      "Муха. Лапа. Муха. Лапа. Муха-муха-муха. Лапа-лапа-лапа.",
      "— Пушкоооо! Дас іст фантастішь! — Радісно підстрибував Ракета. — Шфідки ти знаєш мій улюблений собачий фальс?",
      "— Я? Собачий вальс?",
      "— Так! Ти! Шойно! Які, які ти клафіші шойно натискала?",
      "— Оцю… І ще, здається, оцю. І може оцю…",
      "Хвилинку подумавши, Пушка натисла усі клавіші, по яких до того пролізла муха.",
      "В кімнаті залунала музика і щасливий Ракета закружляв по паркету.",
      " ",
      "Кінець"
    ];

class Tags {
  Tags._();

  static const String text = 'text';
  static const String author = 'author';
  static const String audio = 'audio';
  static const String poem = 'poem';
  static const String lullaby = 'lullaby';
}
